[
  {
    "author": "<span class='font-bold'>Wang, G.</span>, Chen, X., Zhang, F., Wang, Y., & Zhang, D. (2019).",
    "title": "Experience: Understanding Long-Term Evolving Patterns of Shared Electric Vehicle Networks.",
    "link": "ePat_Guang.pdf",
    "source": "In Proceedings of the 25th Annual International Conference on Mobile Computing and Networking (ACM MobiCom)."
  },
   {
    "author": "<span class='font-bold'>Wang, G.</span>, Li, W., Zhang, J., Ge, Y., Fu, Z., Zhang, F., Wang, Y., & Zhang, D. (2019).",
    "title": "sharedCharging: Data-Driven Shared Charging Scheduling for Large-Scale Heterogeneous Electric Vehicle Fleets.",
    "link": "",
    "source": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (ACM IMWUT/UbiComp) 2019."
  },
  {
    "author": "<span class='font-bold'>Wang, G.</span>, Xie, X., Zhang, F., Liu, Y., & Zhang, D. (2018).",
    "title": "bCharge: Data-Driven Real-Time Charging Scheduling for Large-Scale Electric Bus Fleets.",
    "link": "wang2018bcharge.txt",
    "source": "In 2018 IEEE Real-Time Systems Symposium (IEEE RTSS)."
  },
   {
    "author": "<span class='font-bold'>Wang, G.</span> & Zhang, D. (2019).",
    "title": "Understanding Long-Term Evolving Mobility and Charging of Shared EV Networks.",
    "link": "ePat_Guang.pdf",
    "source": "In Proceedings of the 25th Annual International Conference on Mobile Computing and Networking (Poster@MobiCom) ACM."
  },
  {
    "author": "Xie, X., Yang, Y., Fang, Z., <span class='font-bold'>Wang, G.</span>, Zhang, F., Zhang, F., Liu, Y. and Zhang, D. (2019).",
    "title": "coSense: Collaborative Urban-Scale Vehicle Sensing Based on Heterogeneous Fleets",
    "link": "xie2018.txt",
    "source": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (ACM IMWUT/UbiComp) 2018."
  },
  {
    "author": "Lin, C., <span class='font-bold'>Wang, G.*</span> (2017).",
    "title": "Failure Cause Extraction of Railway Switches Based on Text Mining.",
    "link": "lin2017failure.txt",
    "source": " In Proceedings of the 2017 International Conference on Computer Science and Artificial Intelligence (ACM CSAI)."
  },
  {
    "author": "<span class='font-bold'>Wang, G.</span>, Xu, T., Wang, H., & Zou, Y. (2016).",
    "title": "AdaBoost and least square based failure prediction of railway turnouts.",
    "link": "wang2016adboost.txt",
    "source": "In 2016 9th IEEE International Symposium on Computational Intelligence and Design (IEEE ISCID)."
  },
  {
    "author": "Xu, T., <span class='font-bold'>Wang, G.</span>, & Wang, H. (2016). ",
    "title": "Multiple Fault Diagnosis and Prognosis of Chinese Train Control Systems.",
    "link": "xu2016multiple.txt",
    "source": "1st International Workshop on Structural Health Monitoring for Railway System."
  }
]
