[
  {
    "title": "2019 Summer: Discrete Structure I",
    "content": "To introduce the student to the mathematical tools of logic and induction, and to the basic definitions and theorems concerning relations, functions, and sets. Later courses in the computer science curriculum build on the mathematical foundations covered here. Particular emphasis is placed on inductive definitions and proofs, with application to problems in computer science.",
    "figure": "teach1.png"
  },
  {
    "title": "2019 Spring: Principles of Programming Languages",
    "content": "This course covers different paradigms of programming languages. Topics: (i) Imperative programming and Python; (ii) Concepts underlying programming languages, e.g., dynamic and static typing, grammars, Lambda calculus. (iii) Functional programming, e.g., Scheme and Haskell. (iv) Logic programming and Prolog.",
  },
  {
    "title": "2018 Fall: Discrete Structure II",
    "content": "To learn some interesting and useful elements of combinatorics and discrete probability and how they apply to Computer Science and to life.",
    "figure": ""
  },
  {
    "title": "2018 Summer: Discrete Structure I",
    "content": "To introduce the student to the mathematical tools of logic and induction, and to the basic definitions and theorems concerning relations, functions, and sets. Later courses in the computer science curriculum build on the mathematical foundations covered here. Particular emphasis is placed on inductive definitions and proofs, with application to problems in computer science.",
    "figure": ""
  },
  {
    "title": "2018 Spring: Principles of Programming Languages",
    "content": "Objectives. Primary objective: Learn new ways of thinking about problems and programs. Secondary objective: Make it easier to learn new languages by learning principles that apply to many languages. Tertiary objective: Learn some interesting languages. This course introduces many programming languages, e.g., Python, Scheme, Prolog, Haskell.",
    "figure": ""
  },
  {
    "title": "2017 Fall: Discrete Structure I",
    "content": "To introduce the student to the mathematical tools of logic and induction, and to the basic definitions and theorems concerning relations, functions, and sets. Later courses in the computer science curriculum build on the mathematical foundations covered here. Particular emphasis is placed on inductive definitions and proofs, with application to problems in computer science.",
    "figure": ""
  }
]

,
  {
    "title": "Fairness-Aware System (ICDE 2021, UbiComp 2020)",
    "content": "In the past a few years, I am always thinking of what research I can do to benefit our society. I realize it would be more meaningful if our research can focus on humans, especially those people who are at a disadvantage. We always talk about Fairness, but it is hard for us to have a consistent definition since different people may have their own ideas. There is a long history of economics and sociologists to seek the answer of fairness, especially in the world with so many high-tech inventions. In this work, we discuss and try to quantify the fairness in the recommendation systems, which has the potential to make the recommendation systems more sustainable and acceptable by users.",
    "figure": "fairness.jpeg",
    "link": ""
  },
  {
    "title": "Measurement of 5-Year Electric Taxi Evolving Patterns (MobiCom 2019)",
    "content": "In this work, we make the first effort to understand the long-term evolving mobility and charging patterns through a five-year study on one of the largest electric taxi networks in the world, i.e., the Shenzhen electric taxi network in China. Our ePat as a comprehensive investigation of the electric taxi network mobility and charging evolving has the potential to advance the understanding of the evolving patterns of electric taxi networks and pave the way for analyzing future shared autonomous vehicles.",
    "figure": "ePat1.png",
    "link": ""
  },
  {
    "title": "Electric Bus Charging Scheduling (RTSS 2018, TIST 2020)",
    "content": "In this work, we performed a data-driven observation for operation and charging patterns of large-scale electric bus fleets. Based on the findings and insights we obtained from this investigation, we designed the first electricity pricing-aware real-time charging scheduling system for large-scale electric bus fleets.",
    "figure": "bCharge.png",
    "link": ""
  },
    {
    "title": "Failure Diagnosis and Prediction of Railway Turnouts (IEEE TITS 2021, ESWA 2017)",
    "content": "For this project, we developed a set of methods (including text mining, image processing, machine learning based approaches) to diagnose and predict failures of railway turnouts based on six-year real-world data.",
    "figure": "turnout.png",
    "link": ""
  }
