[
{
    "title": "June, 2025",
    "content": "We will co-organize the Big Data and Machine Learning Systems Track Co-Chair of The 31st IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS 2025)! Please consider submitting your excellent work! <a href=\"http://ieee-icpads.org.cn/CFP-research-paper.html\" target=\"_blank\">ICPADS 2025 Website</a>",
    "figure": ""
  },
    {
    "title": "June, 2025",
    "content": "We will co-organize the Inaugural ACM SIGSPATIAL Workshop on Spatial Intelligence for Smart and Connected Communities (SpatialConnect) in Minneapolis! Please consider submitting your excellent work! <a href=\"https://spatialconnect.github.io/2025/\" target=\"_blank\">SpatialConnect 2025 Website</a>",
    "figure": ""
  },
  {
    "title": "June, 2025",
    "content": "One paper about Network Robustness is accepted by IEEE TMC!",
    "figure": ""
  },
  {
    "title": "May, 2025",
    "content": "One paper about Multi-task Heterogeneous GNNs is accepted by KDD 2025 (ADS Track, acceptance rate: 21%)! Congratulations to Xinyue!",
    "figure": ""
  },
 {
    "title": "May, 2025",
    "content": "One paper about Uncertainty Calibration of LLM is accepted by ACL 2025 (Industry Track)! Congratulations to Zejun!",
    "figure": ""
  },
     {
    "title": "May, 2025",
    "content": "One paper about Edge-assisted Autonomous Driving is accepted by ACM Transactions on Embedded Computing Systems (TECS)!",
    "figure": ""
  },
  {
    "title": "May, 2025",
    "content": "Excited to share that my PhD student Lin's paper about human-centered ride-hailing got accepted by IJCAI 2025 (Human-Centred Artificial Intelligence Track, acceptance rate: 8%)! Congratulations to Lin!",
    "figure": ""
  },
    {
    "title": "May, 2025",
    "content": "Served on an NSF panel.",
    "figure": ""
  },
 {
    "title": "April, 2025",
    "content": "Excited to share that my PhD student Lin's paper about AI-enabled Post-Disaster Power Restoration got accepted by IJCAI 2025 (AI and Social Good Track, acceptance rate: 18.5%)! Congratulations to Lin!",
    "figure": ""
  },
   {
    "title": "April, 2025",
    "content": "Honored to receive the CS Department Faculty Research Award! Grateful to be the sole recipient this year. Many thanks to our department for the continued support!",
    "figure": "FacultyAward.jpg"
  },
  {
    "title": "April, 2025",
    "content": "Honored to receive the Dean's Travel Award!",
    "figure": ""
  },
  {
    "title": "April, 2025",
    "content": "Excited to share that my PhD student Lin won the Research Presentation Award Runner-up at CS Expo 2025! Congratulations to Lin.",
    "figure": ""
  },
   {
    "title": "April, 2025",
    "content": "Served on an NSF panel.",
    "figure": ""
  },
    {
    "title": "March, 2025",
    "content": "I am honored to deliver a spotlight talk about AI for Sustainability at FSU's Collaborative Collision, an interdisciplinary networking event hosted by the FSU Research Development.",
    "figure": "cclogo.png"
  },
  {
    "title": "March, 2025",
    "content": "I am honored to receive the FSU/AWS Computer Support Seed Fund! Many thanks to the VPR office and AWS!",
    "figure": "FSUAWS.jpg"
  },
    {
    "title": "February, 2025",
    "content": "Honored to join the Editorial Board of Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) as an Associate Editor!",
    "figure": ""
  },
  {
    "title": "December, 2024",
    "content": "Excited to share my PhD student Rongchao's paper about trajectory data generation was accepted by SDM! Congratulations to Rongchao!",
    "figure": ""
  },
 {
    "title": "December, 2024",
    "content": "Our project about privacy-preserving Generative AI has been awarded by the NSF-led National Artificial Intelligence Research Resource Pilot (NAIRR).",
    "figure": ""
  },
 {
    "title": "December, 2024",
    "content": "One paper got accepted by AAAI 2025.",
    "figure": ""
  },
 {
    "title": "December, 2024",
    "content": "Excited to join the Institute for Successful Longevity as a faculty affiliate. Looking forward to collaborating on AI for healthcare.",
    "figure": ""
  },
    {
    "title": "November, 2024",
    "content": "One paper about human knowledge-enhanced AI got accepted by ACM KDD 2025.",
    "figure": ""
  },
    {
    "title": "November, 2024",
    "content": "Invited to give a talk for FSU Data Science program students.",
    "figure": ""
  },
  {
    "title": "September, 2024",
    "content": "One paper got accepted by ACM SIGCHI Conference on Computer-Supported Cooperative Work & Social Computing (ACM CSCW).",
    "figure": ""
  },
    {
    "title": "August, 2024",
    "content": "Two papers got accepted by ACM SIGSPATIAL 2024.",
    "figure": ""
  },
     {
    "title": "July, 2024",
    "content": "Glad to give a talk about AI for Sustainability for Tallahassee high school students.",
    "figure": ""
  },
     {
    "title": "July, 2024",
    "content": "Three papers are accepted by ACM CIKM 2024",
    "figure": ""
  },
   {
    "title": "June, 2024",
    "content": "Honored to give a talk at UND's Distinguished Webinar in AI/Cybersecurity",
    "figure": ""
  },
     {
    "title": "June, 2024",
    "content": "One paper about large-scale graph data mining is accepted by 50th International Conference on Very Large Databases (VLDB 2024)",
    "figure": ""
  },
   {
    "title": "June, 2024",
    "content": "One paper about fairness-aware urban sensing is accepted by The 21st IEEE International Conference on Mobile Ad-Hoc and Smart Systems (IEEE MASS 2024)",
    "figure": ""
  },
    {
    "title": "June, 2024",
    "content": "Our sustainability project is featured on the FSU homepage.  <a href=\"https://news.fsu.edu/news/science-technology/2024/05/30/aspire-fsu-faculty-members-lead-work-to-craft-sustainable-solutions-for-a-resilient-future/?utm_source=newsletter&utm_medium=email&utm_campaign=the_big_story_june_3_2024&utm_term=2024-06-03\" target=\"_blank\">Sustainable Solutions</a>",
    "figure": "FSUNews.png"
  },
   {
    "title": "June, 2024",
    "content": "Invited to serve on an NSF Panel.",
    "figure": ""
  },
   {
    "title": "May, 2024",
    "content": "Invited to serve on a DOE Panel.",
    "figure": ""
  },
   {
    "title": "May, 2024",
    "content": "Invited to serve on an NSF Panel.",
    "figure": ""
  },
    {
    "title": "May, 2024",
    "content": "One paper about Behavior-Aware Coordinates Mining is accepted by IEEE Transactions on Knowledge and Data Engineering (TKDE). Excellent work.",
    "figure": ""
  },
  {
    "title": "May, 2024",
    "content": "Two papers are accepted by ACM KDD. One is about Mobility Data Privacy Risk and another is about Link Prediction in Billion-Scale Commercial Heterogeneous Graphs. Excellent work.",
    "figure": ""
  },
 {
    "title": "April, 2024",
    "content": "Congratulations to my PhD student Tonmoy for successfully passing his Prospectus Defense and also winning the Outstanding TA Award! Excellent research and teaching achievements!",
    "figure": ""
  },
    {
    "title": "April, 2024",
    "content": "I gave a guest lecture in FAMU-FSU College of Engineering. Thank Dr. Guo for the invitation!",
    "figure": ""
  },
{
    "title": "April, 2024",
    "content": "Our project in collaboration with Rutgers and UCLA was funded by NSF (my role: FSU PI). Many thanks to the NSF and our fabulous team!",
    "figure": "NSF.png"
  },
 {
    "title": "April, 2024",
    "content": "Our paper about community map generation was accepted to ACM IMWUT/UbiComp. Excellent work. One of my favorite papers. Many Thanks to Zhiqing!",
    "figure": ""
  },
  {
    "title": "April, 2024",
    "content": "Congratulations to my graduate student David for successfully defending his thesis. Excellent work on vehicle dispatching and redeployment for Emergency Medical Services with Reinforcement Learning.",
    "figure": ""
  },
    {
    "title": "April, 2024",
    "content": "My undergraduate student Judah presents our EV project at the FSU Undergraduate Research Symposium. Excellent work.",
    "figure": ""
  },
     {
    "title": "March, 2024",
    "content": "I attended the NSF Aspiring CPS PIs' Workshop and PI meeting. Thank NSF for providing this great opportunity. Wonderful experience.",
    "figure": ""
  },
    {
    "title": "Feb, 2024",
    "content": "I attended the NSF S&CC PI meeting. Thank NSF for providing this great opportunity. Wonderful experience.",
    "figure": ""
  },
{
    "title": "January, 2024",
    "content": "Our paper finally got accepted by Nature Cities after a very long journey. This is the major project I did at MIT. This is also my first paper to be published in a Nature journal. Very excited for the new start! A great thanks to Shenhao, Yunhan, Taka, Esteban, and Sandy. The great team, Cheers.",
    "figure": ""
  },
      {
    "title": "January, 2024",
    "content": "Honored to receive the UROP Materials Grant funding.",
    "figure": ""
  },
   {
    "title": "December, 2023",
    "content": "One paper on Offline Reinforcement Learning is accepted by AAAI'24. This is the first work to develop Offline RL for large-scale order dispatching problems.",
    "figure": ""
  },
    {
    "title": "December, 2023",
    "content": "One paper on Time-Constrained Actor-Critic Reinforcement Learning is accepted to IEEE TMC.",
    "figure": ""
  },
   {
    "title": "November, 2023",
    "content": "Invited to serve on the NSF Panel.",
    "figure": ""
  },
   {
    "title": "November, 2023",
    "content": "Glad to hear that my Curricular Request for Data Science for Smart Cities has been approved by UCC and assigned an official course number CAP5795 after about one year with several rounds of revision. This course will be the first Data Science for Smart Cities course offered in Florida. Looking forward to witnessing the impact at the State University System of Florida.",
    "figure": ""
  },
    {
    "title": "October, 2023",
    "content": "One paper about UQ is accepted to TGL@NeurIPS as one of the four long Spotlight Papers (Best Paper Candidate) for a 20-minute presentation.",
    "figure": ""
  },
    {
    "title": "October, 2023",
    "content": "One paper is accepted to IEEE TMC.",
    "figure": ""
  },
  {
    "title": "October, 2023",
    "content": "My undergraduate student Judah Alter was funded by the FSU UROP (Undergraduate Research Opportunity Program).",
    "figure": ""
  },
  {
    "title": "August, 2023",
    "content": "Four papers on Smart Cities are accepted by ACM CIKM.",
    "figure": ""
  },
   {
    "title": "June, 2023",
    "content": "Our EV project is funded by the Sustainability & Climate Solutions Grant Program with $150,000. Thank Florida State University Office of the President and our Great team.",
    "figure": "SCS.png"
  },
    {
    "title": "May, 2023",
    "content": "One paper about fairness-aware concurrent dispatch is accepted to ACM KDD.",
    "figure": ""
  },
  {
    "title": "April, 2023",
    "content": "Honored to receive the FSU Collaborative Collision Runner-up Award 2023. <a href=\"https://www.youtube.com/watch?v=f2dD7-p2ML4\" target=\"_blank\">Project Video</a> ",
    "figure": "HealthCC.png"
  },
 {
    "title": "March, 2023",
    "content": "Honored to receive the FSU FYAP Award with $20,000.",
    "figure": ""
  },
  {
    "title": "March, 2023",
    "content": "My undergraduate student Ian Bridges was awarded the FSU IDEA Grant.",
    "figure": ""
  },
  {
    "title": "March, 2023",
    "content": "One paper is accepted to IEEE TBD.",
    "figure": ""
  },
  {
    "title": "Feb, 2023",
    "content": "One paper is accepted to IEEE ICDE.",
    "figure": ""
  },
   {
    "title": "Feb, 2023",
    "content": "One paper is accepted to IEEE TKDE.",
    "figure": ""
  },
 {
    "title": "Jan, 2023",
    "content": "PC for KDD 2023 and PC for IJCAI 2023.",
    "figure": ""
  },
  {
    "title": "Jan, 2022",
    "content": "One paper is accepted by IEEE TITS.",
    "figure": ""
  },
   {
    "title": "December, 2022",
    "content": "I received the IEEE Outstanding Leadership Award.",
    "figure": ""
  },
   {
    "title": "December, 2022",
    "content": "I am thrilled to share that our team won the Runner-Up Award in the FSU Collaborative Collision.",
    "figure": "CC.png"
  },
   {
    "title": "November, 2022",
    "content": "One paper about Charging Resource Allocation is accepted by ACM TOSN.",
    "figure": ""
  },
  {
    "title": "November, 2022",
    "content": "One paper about Parking Sharing is accepted by IEEE TKDE.",
    "figure": ""
  },
  {
    "title": "October, 2022",
    "content": "One paper about autonomous vehicle fleet management is accepted by IEEE TMC.",
    "figure": ""
  },
   {
    "title": "September, 2022",
    "content": "I was invited to be a reviewer of Information Sciences.",
    "figure": ""
  },
  {
    "title": "September, 2022",
    "content": "I was invited to be a reviewer of IEEE TVT and Transportation Research Part B.",
    "figure": ""
  },
  {
    "title": "August, 2022",
    "content": "One paper about human mobility analysis has been accepted to the Nature Scientific Reports.",
    "figure": ""
  },
  {
    "title": "August, 2022",
    "content": "Two papers have been accepted to ACM SIGSPATIAL as full papers (Accept Ratio=23.8%).",
    "figure": ""
  },
   {
    "title": "August, 2022",
    "content": "Serve as the PC member of AAAI'23, CSCW'23.",
    "figure": ""
  },
  {
    "title": "August, 2022",
    "content": "Our paper about fairness in last-mile delivery has been accepted to ACM CIKM.",
    "figure": ""
  },
   {
    "title": "July, 2022",
    "content": "I present our NSF CDS&E project in Washington DC.",
    "figure": ""
  },
   {
    "title": "June, 2022",
    "content": "I will serve as the Publicity Chair of the 20th IEEE SmartCity 2022. Please consider submitting.  <a href=\"http://www.ieee-cybermatics.org/2022/smartcity/index.html\" target=\"_blank\"> Website</a> ",
    "figure": ""
  },
   {
    "title": "June, 2022",
    "content": "Our paper on Vehicle-Road Scheduling has been accepted to IEEE TMC.",
    "figure": ""
  },
   {
    "title": "May, 2022",
    "content": "Our paper on Named Entity Recognition has been accepted to IEEE TITS.",
    "figure": ""
  },
  {
    "title": "May, 2022",
    "content": "Our paper on Traffic Pattern Inference has been accepted to IEEE TVT.",
    "figure": ""
  },
  {
    "title": "April, 2022",
    "content": "I am selected as one of the CPS Rising Stars 2022.",
    "figure": "cps.png"
  },
    {
    "title": "April, 2022",
    "content": "I will be joining the Department of Computer Science at Florida State University as a tenure-track assistant professor in 2022 Fall. I am looking for motivated Ph.D. and M.S. students, and undergraduate researchers. If you are interested, please email me with a copy of your CV to start a conversation.",
    "figure": ""
  },
    {
    "title": "December, 2021",
    "content": "Our paper about using Reinforcement Learning for instant delivery received the Outstanding Paper Award from IEEE RTSS 2021.",
    "figure": "Award.png"
  },
   {
    "title": "November, 2021",
    "content": "I was invited to serve as the TPC member of the Web Conference (WWW 2022).",
    "figure": ""
  },
  {
    "title": "November, 2021",
    "content": "I was invited to give a guest lecture at Lehigh University.",
    "figure": ""
  },
  {
    "title": "October, 2021",
    "content": "One paper about human mobility verification is accepted by ACM IMWUT/UbiComp 2022.",
    "figure": ""
  },
   {
    "title": "September, 2021",
    "content": "I join MIT as a Postdoctoral Associate, working with Prof. Alex 'Sandy' Pentland and Prof. Desheng Zhang.",
    "figure": ""
  },
  {
    "title": "September, 2021",
    "content": "I present our paper about user behavior in car sharing services at UbiComp 2021.",
    "figure": ""
  },
 {
    "title": "August, 2021",
    "content": "I have successfully defended my Ph.D. thesis. Cheers！",
    "figure": ""
  },
  {
    "title": "August, 2021",
    "content": "One paper about fault prediction of railway systems is accepted by IEEE TITS.",
    "figure": ""
  },
    {
    "title": "August, 2021",
    "content": "I present our paper about electric carsharing fleet management at KDD 2021.",
    "figure": ""
  },
   {
    "title": "August, 2021",
    "content": "One paper about deep reinforcement learning for instant delivery dispatching is accepted by IEEE RTSS 2021.",
    "figure": ""
  },
    {
    "title": "July, 2021",
    "content": "One paper about multi-agent reinforcement learning for train control is accepted by Control Engineering Practice.",
    "figure": ""
  },
  {
    "title": "June, 2021",
    "content": "I participate in the Summer Institutes in Computational Social Science (SICSS-Beijing). Website: https://sicss.io/2021/beijing/ . Wonderful experience.",
    "figure": ""
  },
  {
    "title": "June, 2021",
    "content": "Two papers are accepted by IEEE ITSC 2021. One is about Named Entity Recognition, the other is about Topic Model for fault prediction.",
    "figure": ""
  },
  {
    "title": "May, 2021",
    "content": "Two papers are accepted by KDD 2021. One is about electric carsharing fleet management, the other is about Large-Scale Driving Pattern Characterization for Usage-based Insurance",
    "figure": ""
  },
 {
    "title": "April, 2021",
    "content": "I present our paper about deep reinforcement learning based electric taxi fleet management at IEEE ICDE 2021.",
    "figure": ""
  },
  {
    "title": "April, 2021",
    "content": "I attend the 2021 NSF Smart & Connected Communities Principal Investigators' Meeting.",
    "figure": ""
  },
  {
    "title": "January, 2021",
    "content": "One paper is accepted by ACM IMWUT (UbiComp 2021).",
    "figure": ""
  },
  {
    "title": "December, 2020",
    "content": "One paper is accepted by IEEE ITSM.",
    "figure": ""
  },
   {
    "title": "October 10th, 2020",
    "content": "I get married with my wife.",
    "figure": ""
  },
   {
    "title": "October, 2020",
    "content": "One paper is accepted by ACM IMWUT (UbiComp 2021).",
    "figure": ""
  },
   {
    "title": "October, 2020",
    "content": "Two Papers are accepted by IEEE ICDE 2021.",
    "figure": ""
  },
    {
    "title": "October, 2020",
    "content": "One Paper is accepted by ACM TIST.",
    "figure": ""
  },
    {
    "title": "September, 2020",
    "content": "I present our paper FairCharging at ACM UbiComp 2020.",
    "figure": ""
  },
{
    "title": "July, 2020",
    "content": "One Paper is accepted by IEEE/RSJ IROS'20.",
    "figure": ""
  },
  {
    "title": "June, 2020",
    "content": "One Paper is conditionally accepted by ACM MobiCom'20.",
    "figure": ""
  },
  {
    "title": "April, 2020",
    "content": "A new paper is accepted by ACM TIST.",
    "figure": ""
  },
  {
    "title": "January, 2020",
    "content": "A new paper is accepted by WWW 2020.",
    "figure": ""
  },
  {
    "title": "January, 2020",
    "content": "A new paper is accepted by ACM IMWUT (UbiComp 2020).",
    "figure": ""
  },
  {
    "title": "November, 2019",
    "content": "I present our poster paper tCharge at ACM SenSys 2019 in NYC.",
    "figure": ""
  },
  {
    "title": "October, 2019",
    "content": "I present our poster paper at ACM MobiCom 2019 in Los Cabos, Mexico.",
    "figure": ""
  },
  {
    "title": "October, 2019",
    "content": "I present our paper ePat at ACM MobiCom 2019 in Los Cabos, Mexico.",
    "figure": ""
  },
  {
    "title": "October, 2019",
    "content": "One paper is accepted by Measurement.",
    "figure": ""
  },
 {
    "title": "September, 2019",
    "content": "I present our paper sharedCharging at ACM UbiComp 2019 in London.",
    "figure": ""
  },
 {
    "title": "August, 2019",
    "content": "Two poster papers are accepted by ACM MobiCom and ACM SenSys, respectively.",
    "figure": ""
  },
    {
    "title": "July, 2019",
    "content": "A new paper is accepted by ACM IMWUT (UbiComp 2019).",
    "figure": ""
  }
]
