[
    {
    "title": "Mar 16, 2016",
    "content": "Can Hu was awarded the competitive Graduate Student Conference Scholarship by the American Society of Mechanical Engineers (ASME) to present his research at the Joint Rail Conference in 2016 (Can's work focuses on data analytics and modeling of track condition data). Congratulations, Can!",
    "figure": ""
  },
  {
    "title": "Feb 23, 2016",
    "content": "Yanlei Wang and Ling Ma were awarded the competitive Graduate Student Conference Scholarship by the American Society of Mechanical Engineers (ASME) to present their respective research at the Joint Rail Conference in 2016 (Yanlei' work is train collision risk modeling and Ling's work is spatial risk analysis of train derailments). Congratulations, Yanlei and Ling!",
    "figure": ""
  },
  {
    "title": "Feb 18, 2016",
    "content": "Under the auspices of the American Railway Engineering and Maintenance of Way Association (AREMA) and Rutgers University, the first AREMA Student Chapter at Rutgers University (Rutgers Rail) was established in Spring 2016. Christian Higgins (current group member) is the founding President of the Chapter, supported by his board members, Nicole Todd (Vice President), Kang Zhou (Treasurer), and Yanlei Wang (Secretary). As the only rail-focused student organization in New Jersey/New York metropolitan area, this chapter will actively build a tie between Rutgers University and the railway industry. The AREMA generously provides gift fund to support the initiation of this chapter. The Faculty Advisors of this chapter include Dr. Xiang Liu and Dr. Trefor Williams.",
    "figure": ""
  },
  {
    "title": "Feb 18, 2016",
    "content": "Congratulations to Xiangyi Guo (former group member) on accepting a Research Analyst position at Quantcast in San Francisco. Xiangyi has participated in railroad safety and risk analysis research in the fall of 2014. Best luck on your new position, Xiangyi!",
    "figure": ""
  },
  {
    "title": "Jan 11, 2016",
    "content": "Kang Zhou gave a poster presentation entitled “Risk-based ship collision- avoidance maneuvers under bunker consumption optimization” on the Annual Meeting of Transportation Research Board at D.C. Good job, Kang!",
    "figure": "trb-2016.jpg"
  },
  {
    "title": "Dec 02, 2015",
    "content": "Dr. David Thurston (VP of Atkins) gave an informative presentation on railroad capacity, train control systems and civil designs. Thanks, Dr. Thurston!",
    "figure": "event-120215.jpg"
  },
  {
    "title": "Nov 27, 2015",
    "content": "Congratulations to Xiaoxi Ma (former group member) on accepting a data scientist position at Optimal Strategix Group. Xiaoxi has participated in geospatial risk analysis of railroad accidents in the summer of 2015 and recently received her M.S. in Statistics from Rutgers University. Best luck on your new position, Xiaoxi!",
    "figure": ""
  },
  {
    "title": "Nov 23, 2015",
    "content": "Ms. Ingrid Schultze (Rutgers alumna), a successful serial entrepreneur specialized in applied operations research, shared her experience with students and suggested how to stand out in the career. Thanks very much, Ingrid!",
    "figure": "event-112315.jpg"
  },
  {
    "title": "Nov 05, 2015",
    "content": "Mr. Anthony Murray from the Pipeline and Hazardous Materials Safety Administration (PHMSA) gave an informative presentation regarding hazmat transportation regulations",
    "figure": "event-110515.jpg"
  },
  {
    "title": "Oct 14, 2015",
    "content": "The group had its first academic writing training workshop. Dr. David Jones, a professional English editor, was invited to give a lecture on how to improve writing skills.",
    "figure": "event-101415.jpg"
  },
  {
    "title": "Oct 13, 2015",
    "content": "Kang Zhou's paper entitled \"Risk-based ship collision-avoidance maneuvers under bunker consumption optimization\" was accepted into the Proceedings of the Annual Meeting of Transportation Research Board. He will present this work at D.C. in 2016. Congratulations, Kang!",
    "figure": ""
  },
  {
    "title": "Sep 29, 2015",
    "content": "Six abstracts have been accepted to the Joint Rail Conference in South Carolina in 2016. The studies cover train accident risk analysis and infrastructure management. Can, Tal, Jiabo, Ling, Yanlei, Yubo are eligible for applying for a travel scholarship",
    "figure": ""
  },
  {
    "title": "Sep 20, 2015",
    "content": "Can Hu submitted a final report to the Railway Applications Section (RAS) of the Institute for Operations Research and the Management Sciences (INFORMS) for a competition on railroad data analytics. His research, entitled \"Predicting Track Geometry Degradation using Data Mining Techniques\" addresses data-driven railroad infrastructure management. Good luck, Can!",
    "figure": ""
  },
  {
    "title": "Aug 05, 2015",
    "content": "Congratualtions to Can Hu for receiving a NSF travel award to present his railroad data analytics research in Seattle. Good job, Can!",
    "figure": ""
  }
]
