[
   {
    "author": "<span class='font-bold'>Guang Wang</span>, Fan Zhang, Yang Wang, Huijun Sun, and Desheng Zhang (2020).",
    "title": "Understanding the Long-Term Evolution of Electric Taxi Networks: A Longitudinal Measurement Study on Mobility and Charging Patterns.",
    "link": "ElectricTaxi.pdf",
    "source": "ACM Transaction on Intelligent Systems and Technology <span class='font-bold'>(ACM TIST)</span>."
  },
  {
    "author": "<span class='font-bold'>Guang Wang</span>, Zhihan Fang, Xiaoyang Xie, Shuai Wang, Huijun Sun, Fan Zhang, Yunhuai Liu, and Desheng Zhang (2020).",
    "title": "Pricing-Aware Real-Time Charging Scheduling and Charging Station Expansion for Large-Scale Electric Buses.",
    "link": "busCharging.pdf",
    "source": "ACM Transaction on Intelligent Systems and Technology <span class='font-bold'>(ACM TIST)</span>."
  },
   {
    "author": "<span class='font-bold'>Guang Wang</span>, Tianhua Xu, Tao Tang, Tangming Yuan, and Haifeng Wang (2017).",
    "title": "A Bayesian network model for prediction of weather-related failures in railway turnout systems.",
    "link": "wang2017bayesian.txt",
    "source": "Expert systems with applications <span class='font-bold'>(ESWA)</span>."
  },
    {
    "author": "Yao Zhang, Yu Cheng, Tianhua Xu, <span class='font-bold'>Guang Wang</span>, Cong Chen and Tiantian Yang (2021).",
    "title": "Fault Prediction of Railway Turnout Systems Based on Improved Sparse Auto Encoder and Gated Recurrent Unit Network.",
    "link": "",
    "source": "IEEE Transactions on Intelligent Transportation Systems<span class='font-bold'>(IEEE TITS)</span>."
  },
    {
    "author": "Shuai Su, Xuekai Wang, Tao Tang, <span class='font-bold'>Guang Wang</span>, and Yuan Cao (2021).",
    "title": "Energy-efficient operation by cooperative control among trains: A multi-agent reinforcement learning approach.",
    "link": "",
    "source": "<span class='font-bold'>Control Engineering Practice</span>."
  },
    {
    "author": "Feng Wang, Zhen Zhong, <span class='font-bold'>Guang Wang</span>, and Tao Tang (2020).",
    "title": "A Penalized Convolution Model for Oil Leakage Detection in Electro-hydraulic Railway Point Systems.",
    "link": "",
    "source": "IEEE Transactions on Instrumentation & Measurement <span class='font-bold'>(IEEE TIM)</span>."
  },
   {
    "author": "Ximin Chang, Jianjun Wu, Huijun Sun, <span class='font-bold'>Guang Wang</span>, Ziyan Feng and Xu Bao (2020).",
    "title": "Understanding and predicting short-term passenger flow of station-free shared bike: A spatiotemporal deep learning approach.",
    "link": "",
    "source": "IEEE Intelligent Transportation Systems Magazine <span class='font-bold'>(IEEE ITSM)</span>."
  },
   {
    "author": "Hangyu Qi, Tianhua Xu, <span class='font-bold'>Guang Wang</span>, Yu Cheng, and Cong Chen (2020).",
    "title": "MYOLOv3-Tiny: A New Convolutional Neural Network Architecture for Real-time Detection of Track Fasteners.",
    "link": "TurnoutRUL.txt",
    "source": "<span class='font-bold'>Computers in Industry</span>."
  }
]
