[
  {
    "name": "Kang Zhou",
    "intro": "Kang is a Ph.D. student in Civil Engineering at Rutgers University. His research lies in risk management of hazardous materials transportation. He received his M.S. in Traffic Information Engineering and Control from Dalian Maritime University and stayed there as a lecturer for over two years. He was a visiting scholar at National University of Singapore (NUS) from 2014 to 2015.",
    "avatar": "kangzhou.jpg",
    "publication": [
      {
        "author": "Zhou, K., Chen.J.H., Liu, X. (2016).",
        "title": "Risk-based ship collision-avoidance maneuvers accounting for optimal bunker consumption.",
        "link": "kz1.pdf",
        "source": "TRB Annual Meeting."
      }
    ],
    "honor": []
  },
  {
    "name": "Zheyong Bian",
    "intro": "Zheyong is a Ph.D. student in Civil Engineering at Rutgers University. His research focuses on operations research, logistics optimization and freight transportation. He received a B.S. and M.S., both in Industrial Engineering, from Tianjin University, China.",
    "avatar": "zheyongbian.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Masoud Imaniboossejin",
    "intro": "Masoud is a pursuing his M.S. with a research fellowship. His research addresses transportation safety and risk management. He is currently working on a project related to roadway transportation safety. Masoud received his B.S. degree in Civil Engineering from Sharif University of Technology in Iran, 2015.",
    "avatar": "masoud.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Can Hu",
    "intro": "Can is a M.S student in Statistics at Rutgers University. His current work focuses on big data analytics of track degradation and data-driven infrastructure risk management. He was recently funded by the National Science Foundation (NSF) to present his railroad research at the 2015 NSF Data Science Workshop in Seattle, WA. Can receives his B.S. from Zhejiang University, China, in mathematical statistics.",
    "avatar": "canhu.jpg",
    "publication": [
      {
        "author": "Hu, C., Liu, X. (2016).",
        "title": "Modeling track geometry degradation using support vector machine technique.",
        "link": "canhu1.pdf",
        "source": "Joint Rail Conference, Columbia, South Carolina."
      }
    ],
    "honor": [
      "National Science Foundation Travel Grant on Data Science Workshop, 2015",
	  "ASME JRC Graduate Student Scholarship"
    ]
  },
  {
    "name": "Christian Higgins",
    "intro": "Christian is a M.S. student in City and Regional Planning at Rutgers University.  He has worked on a methodological framework for truck parking development. His current research focuses on railroad infrastructure risk management and safety policy. He has a B.S. in Urban Planning from Cornell University where he additionally conducted rural public transit planning and policy analysis with a local metropolitan planning organization.",
    "avatar": "christian.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Liwei Wang",
    "intro": "Liwei Wang is pursuing a Ph.D. in Statistical Sciences at Rutgers University. Her current work addresses probabilistic modeling of broken rails. She received a M.S. in Mathematics from the University of South Carolina and a B.S. in Mathematics from Shandong University, China.",
    "avatar": "liweiwang.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Ling Ma",
    "intro": "Ling Ma is a M.S student in Statistics at Rutgers University. She is currently working on statistical modeling of railroad infrastructure degradation. She received M.S. degree and B.S. in Pharmaceutics at Peking University, China.",
    "avatar": "lingma.jpg",
    "publication": [],
    "honor": [ 
	"ASME JRC Graduate Student Scholarship"
	]
  },
  {
    "name": "Yanlei Wang",
    "intro": "Yanlei is pursuing a M.S.  degree in Statistics at Rutgers University. She is currently assisting in statistical analysis of train derailments. She received her B.S. in Psychology and B.E. in Industrial Design from Zhejiang University, China.",
    "avatar": "yanleiwang.jpg",
    "publication": [
      {
        "author": "Wang, Y.L., Xu, S., Liu, X. (2016).",
        "title": "Risk analysis of freight train collisions in the United States, 2000-2014.",
        "link": "yanleiwang1.pdf",
        "source": "Joint Rail Conference, Columbia, South Carolina."
      }
    ],
    "honor": [
	"ASME JRC Graduate Student Scholarship"
	]
  },
   {
    "name": "Hayley Todd",
    "intro": "Hayley is pursuing an M.S. in City and Regional Planning at Rutgers University. She is currently assisting with transportation infrastructure asset management research. She received a B.A. in Geography from the University of Mary Washington in Virginia.",
    "avatar": "hayley.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Brian Leckie",
    "intro": "Brian is a M.S. student in City and Regional Planning at Rutgers University. He is currently working on a methodology report concerning broken rail risk analysis. He received a B.A. in Urban Studies from the University of Pittsburgh in 2013. In 2012, he completed a summer internship in transportation planning near Washington, D.C., where he worked on coding for a travel demand model.",
    "avatar": "brian.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Jiayue Ding",
    "intro": "Jiayue is a M.S student in Statistics at Rutgers University. She recently joined Dr. Liu’s research team and currently working on transportation and mobility needs and barriers of adults on the autism spectrum data analysis. She received her B.A. in Actuarial Science from University of Connecticut.",
    "avatar": "dingjiayue.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Chang Liu",
    "intro": "Chang Liu is a master student in Statistics at Rutgers University. She is currently assisting in statistical analysis in data set of train derailments. She received her B.S. Information and Computing Sciences and M.S. in Computational Mathematics from Fudan University, China.",
    "avatar": "liuchang.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Daniel Rodriguez",
    "intro": "Daniel is a first year undergraduate student pursuing a B.S. in Urban Planning and Design and a B.A. in Economics at Rutgers University. As an undergraduate student, he has a strong interest in community development, economic development, and transportation planning and how they interrelate. Most recently, he has conducted research under the Collaborative Center of Rutgers University regarding the characteristics and effectiveness of youth programs in the City of New Brunswick. Currently, he is on a team working on railroad infrastructure risk management research.",
    "avatar": "daniel.jpeg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Tal Ben-Gera",
    "intro": "Tal is a senior undergraduate majoring in Structural Engineering at Rutgers University. He is conducting research on broken rail risk analysis. Upon graduation, Tal plans to pursue his masters degree in Strucutral Engineering in Europe.",
    "avatar": "tal.png",
    "publication": [
      {
        "author": "Ben-Gera, T., He, J.B., Liu, X. (2016).",
        "title": "A preliminary methodology for broken rail caused freight train derailment risk analysis.",
        "link": "talbengera1.pdf",
        "source": "Joint Rail Conference, Columbia, South Carolina."
      }
    ],
    "honor": []
  },
  {
    "name": "Jiabo (Chris) He",
    "intro": "Chris is a senior undergraduate at Rutgers University, majoring in Mathematics & Statistics with a minor in Business Administration. He is working on track geometry risk analysis. He was an intern data analyst at Columbia University Medical Center in the summer of 2015.",
    "avatar": "jiabohe.jpg",
    "publication": [
      {
        "author": "He, J.B., Ben-Gera, T., Liu, X. (2016).",
        "title": "Risk analysis of freight-train derailment caused by track geometry defect.",
        "link": "jianbohe1.pdf",
        "source": "Joint Rail Conference, Columbia, South Carolina."
      }
    ],
    "honor": []
  },
  {
    "name": "Yikun Xian",
    "intro": "Yikun Xian is a M.S. student in Computer Science at Rutgers University. His research interest lies in artificial intelligence and its applications to practical problems. He currently works on web application development and data analysis projects. Yikun received his B.E. in Software Engineering from Tongji University, China.",
    "avatar": "yikunxian.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Katherine Chen",
    "intro": "Katherine is an undergraduate student studying Civil Engineering at Rutgers University. Her interests include structural, transportation, and geotechnical engineering. She hopes to explore these fields over the next few years.",
    "avatar": "katherinechen.jpg",
    "publication": [],
    "honor": []
  },
  {
    "name": "Shuang Xu",
    "intro": "Shuang is a M.S. student in Statistics at Rutgers University. She is working on train accident analysis and prevention. She was an intern statistian at Sanofi-Aventis in the summer of 2015. <br> Shuang Xu is currently a Data Analyst at Sanofi-Aventis in Bridgewater, New Jersey.",
    "avatar": "shuangxu.jpg",
    "publication": [],
    "honor": [],
    "alumni": true
  },
  {
    "name": "Xiaoxi Ma",
    "intro": "Xiaoxi received a M.S. in Statistics from Rutgers University in 2015. She has worked on spatial statistical analysis of railroad accidents. She was an intern statistian in Covance Inc in 2014. Xiaoxi is currently a data scientist at Optimal Strategix Group.",
    "avatar": "xiaoxima.jpg",
    "publication": [],
    "honor": [],
    "alumni": true
  },
  {
    "name": "Yubo Qin",
    "intro": "Yubo is a M.S. student in the Department of Electrical and Computer Engineering at Rutgers University. He was instrumental in development of several railroad computer tools since 2014. He received his BS in Automation from University of Electronic Science and Technology of China.",
    "avatar": "yuboqin.jpg",
    "publication": [],
    "honor": [],
    "alumni": true
  },
  {
    "name": "Xiangyi (Meredith) Guo",
    "intro": "Meredith recently received her M.S. in Statistics from Rutgers University. She participated in studies related to railroad safety and risk analysis. In addition to a M.S. in Statistics, she also has a M.S. degree in Cell and Developmental Biology from Rutgers University. <br> Xiangyi is currently a Research Analyst at Quantcast.",
    "avatar": "xiangyiguo.jpg",
    "publication": [],
    "honor": [],
    "alumni": true
  }
]
