[
  {
    "title": "Socially Informed Services Conflict Governance through Specification, Detection, Resolution and Prevention (NSF SCC)",
    "content": "Smart city services are deeply embedded in modern cities aiming to enhance various aspects of citizens’ lives. However, underlying expected or unexpected couplings among services due to complex interactions of social and physical activities are under-explored, which lead to potential conflicts. Using City of Newark in New Jersey as a testbed, this project aims to develop ways of reducing conflicts for ensuring social inclusion and equity of city services to achieve a “harmony “ among various city services. This Project is supported by NSF Smart and Connected Community Program with a total budget of $2,300,000. Website: https://gy1211.wixsite.com/smartnewark",
    "figure": "SmartCity.png",
    "link": ""
  },
  {
    "title": "Shared mobility (Carsharing, Ridesharing, Bikesharing)",
    "content": "Shared mobility, as part of the sharing economy, which is normally app-based and its market has exceeded $60 billion in value across the three largest markets: China, Europe, and the United States. The future will bring even greater gains as self-driving taxis and shuttles become more common. My recent research focuses on investigating different aspects of shared mobility, e.g., user behavior, charging scheduling, and rebalancing. ",
    "figure": "sharedMobility.png",
    "link": ""
  },
  {
    "title": "EV Simulator (By Kush Aswani, Yuefei Chen, and Guang Wang)",
    "content": "For this project, we are trying to design an interactive tool for electric vehicle simulation.",
    "figure": "simulator.gif",
    "link": ""
  },
  {
    "title": "Fairness-Aware System (ICDE 2021, UbiComp 2020)",
    "content": "In the past a few years, I am always thinking of what research I can do to benefit our society. I realize it would be more meaningful if our research can focus on humans, especially those people who are at a disadvantage. We always talk about Fairness, but it is hard for us to have a consistent definition since different people may have their own ideas. There is a long history of economics and sociologists to seek the answer of fairness, especially in the world with so many high-tech inventions. In this work, we discuss and try to quantify the fairness in the recommendation systems, which has the potential to make the recommendation systems more sustainable and acceptable by users.",
    "figure": "fairness.jpeg",
    "link": ""
  },
  {
    "title": "Measurement of 5-Year Electric Taxi Evolving Patterns (MobiCom 2019)",
    "content": "In this work, we make the first effort to understand the long-term evolving mobility and charging patterns through a five-year study on one of the largest electric taxi networks in the world, i.e., the Shenzhen electric taxi network in China. Our ePat as a comprehensive investigation of the electric taxi network mobility and charging evolving has the potential to advance the understanding of the evolving patterns of electric taxi networks and pave the way for analyzing future shared autonomous vehicles.",
    "figure": "ePat1.png",
    "link": ""
  },
   {
    "title": "Shared Charging for Heterogeneous EV Fleets (UbiComp 2019)",
    "content": "In this work, we propose the first data-driven shared charging scheduling strategy for large-scale heterogeneous EV fleets based on three opprtunities obtained from the data-driven investigation.",
    "figure": "coCharge.png",
    "link": ""
  },
  {
    "title": "Electric Bus Charging Scheduling (RTSS 2018, TIST 2020)",
    "content": "In this work, we performed a data-driven observation for operation and charging patterns of large-scale electric bus fleets. Based on the findings and insights we obtained from this investigation, we designed the first electricity pricing-aware real-time charging scheduling system for large-scale electric bus fleets.",
    "figure": "bCharge.png",
    "link": ""
  },
    {
    "title": "Failure Diagnosis and Prediction of Railway Turnouts (ESWA 2017, Sensors 2016)",
    "content": "For this project, we developed a set of methods (including text mining, image processing, machine learning based approaches) to diagnose and predict failures of railway turnouts based on six-year real-world data.",
    "figure": "turnout.png",
    "link": ""
  }
]
