[
  {
    "title": "Fairness-Aware Charging Recommendation System (UbiComp 2020)",
    "content": "In the past two years, I am always thinking of what research I can do to benefit our society. I realize it is more meaningful if our research can focus on humans, especially those people who are at a disadvantage. We always talk about Fairness, but it is hard for us to have a consistent definition since different people may have their own idea. There is a long history of economics and sociologists to seek the answer of fairness, especially in the world with so many high-tech inventions. In this work, we discuss and try to quantify the fairness in the recommendation systems, which has the potential to make the recommendation systems more sustainable and acceptable by users.",
    "figure": "fairness.jpeg",
    "link": ""
  },
  {
    "title": "Measurement of 5-Year Electric Taxi Evolving Patterns (MobiCom 2019)",
    "content": "In this work, we make the first effort to understand the long-term evolving mobility and charging patterns through a five-year study on one of the largest electric taxi networks in the world, i.e., the Shenzhen electric taxi network in China. Our ePat as a comprehensive investigation of the electric taxi network mobility and charging evolving has the potential to advance the understanding of the evolving patterns of electric taxi networks and pave the way for analyzing future shared autonomous vehicles.",
    "figure": "ePat1.png",
    "link": ""
  },
   {
    "title": "Shared Charging for Heterogeneous EV Fleets (UbiComp 2019)",
    "content": "In this work, we propose the first data-driven shared charging scheduling strategy for large-scale heterogeneous EV fleets based on three opprtunities obtained from the data-driven investigation.",
    "figure": "coCharge.png",
    "link": ""
  },
  {
    "title": "Electric Bus Charging Scheduling (RTSS 2018)",
    "content": "In this work, we performed a data-driven observation for operation and charging patterns of large-scale electric bus fleets. Based on the findings and insights we obtained from this investigation, we designed the first electricity pricing-aware real-time charging scheduling system for large-scale electric bus fleets.",
    "figure": "bCharge.png",
    "link": ""
  },
    {
    "title": "Failure Diagnosis and Prediction of Railway Turnouts (ESWA 2017, Sensors 2016)",
    "content": "For this project, we developed a set of methods (including text mining, image processing, machine learning based approaches) to diagnose and predict failures of railway turnouts based on six-year real-world data.",
    "figure": "turnout.png",
    "link": ""
  }
]
