[
  {
    "name": "<span class='font-bold'>Wang, G.</span>, Chen, X., Zhang, F., Wang, Y., & Zhang, D. (2018). Experience: Understanding Long-Term Evolving Patterns of Shared Electric Vehicle Networks. In Proceedings of the 25th Annual International Conference on Mobile Computing and Networking (MobiCom). ACM."
  }, 
  {
    "name": "<span class='font-bold'>Wang, G.</span>, Xie, X., Zhang, F., Liu, Y., & Zhang, D. (2018). bCharge: Data-Driven Real-Time Charging Scheduling for Large-Scale Electric Bus Fleets. In 2018 IEEE Real-Time Systems Symposium (RTSS)."
  }, 
  {
    "name": "Xie, X., Yang, Y., Fang, Z.,<span class='font-bold'>Wang, G.</span>, Zhang, F., Zhang, F., Liu, Y. and Zhang, D. (2019) coSense: Collaborative Urban-Scale Vehicle Sensing Based on Heterogeneous Fleets Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT/UbiComp) 2019."
  }, 
  {
    "name": "Lin, C., <span class='font-bold'>Wang, G.*</span> (2017). Failure Cause Extraction of Railway Switches Based on Text Mining. In Proceedings of the 2017 International Conference on Computer Science and Artificial Intelligence (ACM CSAI)."
  },
  {
    "name": "<span class='font-bold'>Wang, G.</span>, Xu, T., Tang, T., Yuan, T., & Wang, H. (2017). Bayesian network model for prediction of weather-related failures in railway turnout systems. Expert systems with applications (ESWA)."
  },
  {
    "name": "<span class='font-bold'>Wang, G.</span>, Xu, T., Wang, H., & Zou, Y. (2016). AdaBoost and least square based failure prediction of railway turnouts. In 2016 9th IEEE International Symposium on Computational Intelligence and Design (ISCID)."
  },
  {
    "name": "Xu, T., <span class='font-bold'>Wang, G.</span>, Wang, H., Yuan, T., & Zhong, Z. (2016). Gap measurement of point machine using adaptive wavelet threshold and mathematical morphology. Sensors."
  },
  {
    "name": "Xu, T., <span class='font-bold'>Wang, G.</span>, & Wang, H. (2016). Multiple Fault Diagnosis and Prognosis of Chinese Train Control Systems. 1st International Workshop on Structural Health Monitoring for Railway System."
  }
]
